In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
iris = sns.load_dataset('iris')

### 1 - a

In [3]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [4]:
iris.groupby(iris.species).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

### 1 - b

In [5]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [6]:
#이름으로 데이터프레임 세개로 쪼개기
a=iris[iris['species'] == 'setosa']
b=iris[iris['species'] == 'versicolor']
c=iris[iris['species'] == 'virginica']

In [7]:
#이상치 구하기
a1 =a.describe().T['25%'] - 1.5*(a.describe().T['75%']-a.describe().T['25%'])
a2 =a.describe().T['75%'] + 1.5*(a.describe().T['75%']-a.describe().T['25%'])
b1 =b.describe().T['25%'] - 1.5*(b.describe().T['75%']-b.describe().T['25%'])
b2 =b.describe().T['75%'] + 1.5*(b.describe().T['75%']-b.describe().T['25%'])
c1 =c.describe().T['25%'] - 1.5*(c.describe().T['75%']-c.describe().T['25%'])
c2 =c.describe().T['75%'] + 1.5*(c.describe().T['75%']-c.describe().T['25%'])

In [8]:
# 이상치 필터링후 이름 다시 넣어주기
na=a[(a > a1) & (a < a2)]
nb=b[(b > b1) & (b < b2)]
nc=c[(c > c1) & (c < c2)]
na.species = 'setosa'
nb.species = 'versicolor'
nc.species = 'virginica'

In [9]:
# 필터링한 데이터프레임 합치기
newiris = pd.concat([na,nb,nc])

In [10]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [11]:
# 숫자가 안맞는걸 보니 필터링 확인
newiris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    149.000000   145.000000    145.000000   148.000000
mean       5.849664     3.048966      3.826207     1.208108
std        0.827208     0.408948      1.750993     0.763586
min        4.300000     2.000000      1.200000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.400000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.200000      6.900000     2.500000

In [12]:
# 답
newiris.groupby(newiris.species).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  49.000000
             mean    5.006000    5.936000   6.622449
             std     0.352490    0.516171   0.593459
             min     4.300000    4.900000   5.600000
             25%     4.800000    5.600000   6.300000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  48.000000   50.000000  47.000000
             mean    3.431250    2.770000   2.955319
             std     0.320343    0.313798   0.260275
             min     2.900000    2.000000   2.500000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.625000    3.000000   3.100000
             max     4.200000    3.400000   3.600000
petal_length count  46.000000   49.000000  50.000000
             mean    1.460870    4.285714   5.552000
             std     0.129062    0.437798   0.551895
             min     1.200000    3.300000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.400000   5.550000
             75%     1.500000    4.600000   5.875000
             max     1.700000    5.100000   6.900000
petal_width  count  48.000000   50.000000  50.000000
             mean    0.233333    1.326000   2.026000
             std     0.085883    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.400000    1.800000   2.500000

### 2-1 a

In [13]:
titanic = sns.load_dataset("titanic")

In [14]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)

### 2-1 b

In [15]:
titanic['age']=titanic['age'].fillna(titanic['age'].mean())
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 2-1 c

In [58]:
## 여자의 생존율 survived가 1과 0으로 되어있는데 1이 생존이므로 다 더하면 생존자
f = titanic[titanic["sex"] == 'female']
f["survived"].sum() / f.survived.count()*100

74.20382165605095

In [59]:
### 남자의 생존율
m = titanic[titanic["sex"] == 'male']
m["survived"].sum() / m.survived.count()*100

18.890814558058924

In [18]:
### 클래스 확인
titanic.groupby("class").size()

class
First     216
Second    184
Third     491
dtype: int64

In [57]:
### 퍼스트 클래스 생존율
cf = titanic[titanic["class"] == 'First']
cf["survived"].sum() / cf.survived.count()*100

62.96296296296296

In [20]:
### 세컨드 클래스 생존율
cs = titanic[titanic["class"] == 'Second']
cs["survived"].sum() / cs.survived.count()*100

47.28260869565217

In [21]:
### 써드 클래스 생존율
ct = titanic[titanic["class"] == 'Third']
ct["survived"].sum() / ct.survived.count()*100

24.236252545824847

In [22]:
### 출발지 확인
titanic.groupby("embark_town").size()

embark_town
Cherbourg      168
Queenstown      77
Southampton    644
dtype: int64

In [56]:
# 출발지 Cherbourg의 생존율
cher = titanic[titanic["embark_town"] == 'Cherbourg']
cher["survived"].sum() / cher.survived.count()*100

55.35714285714286

In [54]:
# 출발지 Queenstown의 생존율
queens = titanic[titanic["embark_town"] == 'Queenstown']
queens["survived"].sum() / queens.survived.count()*100

38.961038961038966

In [53]:
# 출발지 Southampton의 생존율
south = titanic[titanic["embark_town"] == 'Southampton']
south["survived"].sum() / south.survived.count()*100

33.69565217391305

### 2-d

In [26]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic["age_cat"] = pd.cut(titanic.age, bins, labels=labels)

In [52]:
# 미성년자 생존율
s1 = titanic[titanic["age_cat"] == "미성년자"]
s1["survived"].sum() / s1.survived.count()*100

42.42424242424242

In [51]:
# 청년 생존율
s2 = titanic[titanic["age_cat"] == "청년"]
s2["survived"].sum() / s2.survived.count()*100

33.415233415233416

In [50]:
# 중년 생존율
s3 = titanic[titanic["age_cat"] == "중년"]
s3["survived"].sum() / s3.survived.count()*100

42.32365145228216

In [49]:
# 장년 생존율
s4 = titanic[titanic["age_cat"] == "장년"]
s4["survived"].sum() / s4.survived.count()*100

35.59322033898305

In [48]:
# 노년 생존율
s5 = titanic[titanic["age_cat"] == "노년"]
s5["survived"].sum() / s5.survived.count()*100

20.0

### 2-e

In [36]:
# qcut으로 새 칼럼 만들기
titanic['qcut'] = pd.qcut(titanic.age, 3, labels=["Q1", "Q2", "Q3"])
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_cat,qcut
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년,Q1
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년,Q3
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년,Q2
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년,Q3
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년,Q3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년,Q2
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,Q1
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,청년,Q2
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년,Q2
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,Q3

### 그룹별 생존율

In [46]:
# Q1
q1 = titanic[titanic["qcut"] == "Q1"]
q1["survived"].sum() / q1.survived.count()*100

41.19601328903654

In [45]:
# Q2
q2 = titanic[titanic["qcut"] == "Q2"]
q2["survived"].sum() / q2.survived.count()*100

33.55263157894737

In [44]:
# Q3
q3 = titanic[titanic["qcut"] == "Q3"]
q3["survived"].sum() / q3.survived.count()*100

40.55944055944056

### 그룹별 남녀 생존율

In [60]:
# Q1 의 여자 
q1f = titanic[(titanic["qcut"] == "Q1") & (titanic["sex"] == "female")]
q1f["survived"].sum() / q1f.survived.count()*100

71.31147540983606

In [64]:
# Q1 의 남자 
q1m = titanic[(titanic["qcut"] == "Q1") & (titanic["sex"] == "male")]
q1m["survived"].sum() / q1m.survived.count()*100

20.670391061452513

In [67]:
# Q2 의 여자 
q2f = titanic[(titanic["qcut"] == "Q2") & (titanic["sex"] == "female")]
q2f["survived"].sum() / q2f.survived.count()*100

70.10309278350515

In [68]:
# Q2 의 남자 
q2m = titanic[(titanic["qcut"] == "Q2") & (titanic["sex"] == "male")]
q2m["survived"].sum() / q2m.survived.count()*100

16.425120772946862

In [69]:
# Q3 의 여자 
q3f = titanic[(titanic["qcut"] == "Q3") & (titanic["sex"] == "female")]
q3f["survived"].sum() / q3f.survived.count()*100

82.10526315789474

In [70]:
# Q3 의 남자 
q3m = titanic[(titanic["qcut"] == "Q3") & (titanic["sex"] == "male")]
q3m["survived"].sum() / q3m.survived.count()*100

19.895287958115183